Ran Plan for project: `terraform-discord` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.techtales.data.discord_local_image.prometheus: Reading...
module.techtales.data.discord_local_image.prometheus: Read complete after 0s [id=868849224]
module.techtales.data.discord_local_image.flux: Reading...
module.techtales.data.discord_local_image.flux: Read complete after 0s [id=2257811004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
 <= read (data resources)

Terraform will perform the following actions:

  # discord_category_channel.family will be destroyed
  # (because discord_category_channel.family is not in configuration)
- resource "discord_category_channel" "family" {
-       id        = "1110219290109558814" -> null
-       name      = "🌈・FAMILY" -> null
-       position  = 1 -> null
-       server_id = "829004029127557141" -> null
-       type      = "category" -> null
    }

  # discord_category_channel.general will be destroyed
  # (because discord_category_channel.general is not in configuration)
- resource "discord_category_channel" "general" {
-       id        = "829004029127557142" -> null
-       name      = "🦄・GENERAL" -> null
-       position  = 0 -> null
-       server_id = "829004029127557141" -> null
-       type      = "category" -> null
    }

  # discord_category_channel.home_automation will be destroyed
  # (because discord_category_channel.home_automation is not in configuration)
- resource "discord_category_channel" "home_automation" {
-       id        = "1183189895225815135" -> null
-       name      = "🏠・HOME AUTOMATION" -> null
-       position  = 4 -> null
-       server_id = "829004029127557141" -> null
-       type      = "category" -> null
    }

  # discord_category_channel.home_ops_talos_flux will be destroyed
  # (because discord_category_channel.home_ops_talos_flux is not in configuration)
- resource "discord_category_channel" "home_ops_talos_flux" {
-       id        = "1183167238266699776" -> null
-       name      = "🚢 HOME-OPS - TALOS-FLUX" -> null
-       position  = 3 -> null
-       server_id = "829004029127557141" -> null
-       type      = "category" -> null
    }

  # discord_category_channel.voice will be destroyed
  # (because discord_category_channel.voice is not in configuration)
- resource "discord_category_channel" "voice" {
-       id        = "829004029127557143" -> null
-       name      = "🔊・VOICE CHANNELS" -> null
-       position  = 2 -> null
-       server_id = "829004029127557141" -> null
-       type      = "category" -> null
    }

  # discord_server.techtales will be destroyed
  # (because discord_server.techtales is not in configuration)
- resource "discord_server" "techtales" {
-       afk_channel_id                = "1028684203711271043" -> null
-       afk_timeout                   = 900 -> null
-       default_message_notifications = 1 -> null
-       explicit_content_filter       = 0 -> null
-       icon_hash                     = "feb826c23d0757fefe9febb82091c2ad" -> null
-       id                            = "829004029127557141" -> null
-       name                          = "techtales.io" -> null
-       region                        = "rotterdam" -> null
-       verification_level            = 3 -> null
        # (1 unchanged attribute hidden)
    }

  # discord_text_channel.chat will be destroyed
  # (because discord_text_channel.chat is not in configuration)
- resource "discord_text_channel" "chat" {
-       category                 = "829004029127557142" -> null
-       id                       = "829004029584605184" -> null
-       name                     = "💬・chat" -> null
-       nsfw                     = false -> null
-       position                 = 0 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       type                     = "text" -> null
        # (1 unchanged attribute hidden)
    }

  # discord_text_channel.configs will be destroyed
  # (because discord_text_channel.configs is not in configuration)
- resource "discord_text_channel" "configs" {
-       category                 = "829004029127557142" -> null
-       id                       = "845732411521630250" -> null
-       name                     = "📁・configs" -> null
-       nsfw                     = false -> null
-       position                 = 6 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "configs for later" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.crowlex will be destroyed
  # (because discord_text_channel.crowlex is not in configuration)
- resource "discord_text_channel" "crowlex" {
-       category                 = "829004029127557142" -> null
-       id                       = "1183787416868376658" -> null
-       name                     = "👦・crowlex・🎮" -> null
-       nsfw                     = false -> null
-       position                 = 3 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       type                     = "text" -> null
        # (1 unchanged attribute hidden)
    }

  # discord_text_channel.floor_heating will be destroyed
  # (because discord_text_channel.floor_heating is not in configuration)
- resource "discord_text_channel" "floor_heating" {
-       category                 = "1183189895225815135" -> null
-       id                       = "1183189901177524334" -> null
-       name                     = "🌡・floor-heating" -> null
-       nsfw                     = false -> null
-       position                 = 0 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "floor heating" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.food will be destroyed
  # (because discord_text_channel.food is not in configuration)
- resource "discord_text_channel" "food" {
-       category                 = "829004029127557142" -> null
-       id                       = "1071757677153231010" -> null
-       name                     = "🍲・food" -> null
-       nsfw                     = false -> null
-       position                 = 8 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "mjam mjam mjam.at" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.gametime will be destroyed
  # (because discord_text_channel.gametime is not in configuration)
- resource "discord_text_channel" "gametime" {
-       category                 = "1110219290109558814" -> null
-       id                       = "1145741456410161202" -> null
-       name                     = "🎮・gametime" -> null
-       nsfw                     = false -> null
-       position                 = 1 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "gametime" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.holidays will be destroyed
  # (because discord_text_channel.holidays is not in configuration)
- resource "discord_text_channel" "holidays" {
-       category                 = "829004029127557142" -> null
-       id                       = "1112287821890338856" -> null
-       name                     = "🏖・holidays" -> null
-       nsfw                     = false -> null
-       position                 = 9 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "holiday planning" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.home_automation will be destroyed
  # (because discord_text_channel.home_automation is not in configuration)
- resource "discord_text_channel" "home_automation" {
-       category                 = "1183189895225815135" -> null
-       id                       = "1038191739825045504" -> null
-       name                     = "🧙・home-automation" -> null
-       nsfw                     = false -> null
-       position                 = 3 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "beep beep beep" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.info will be destroyed
  # (because discord_text_channel.info is not in configuration)
- resource "discord_text_channel" "info" {
-       category                 = "1110219290109558814" -> null
-       id                       = "1110219291447545876" -> null
-       name                     = "ℹ・info" -> null
-       nsfw                     = false -> null
-       position                 = 0 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "share all kind of informations with the family" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.links will be destroyed
  # (because discord_text_channel.links is not in configuration)
- resource "discord_text_channel" "links" {
-       category                 = "829004029127557142" -> null
-       id                       = "843230839893393408" -> null
-       name                     = "🔗・links" -> null
-       nsfw                     = false -> null
-       position                 = 5 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "links for later" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.nas will be destroyed
  # (because discord_text_channel.nas is not in configuration)
- resource "discord_text_channel" "nas" {
-       category                 = "1183189895225815135" -> null
-       id                       = "1037451036606091375" -> null
-       name                     = "📢・nas" -> null
-       nsfw                     = false -> null
-       position                 = 2 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "synology disk station alerts and infos" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.reviews will be destroyed
  # (because discord_text_channel.reviews is not in configuration)
- resource "discord_text_channel" "reviews" {
-       category                 = "829004029127557142" -> null
-       channel_id               = "1267956770878525503" -> null
-       id                       = "1267956770878525503" -> null
-       name                     = "reviews" -> null
-       nsfw                     = false -> null
-       position                 = 10 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "reviews" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.service_incidents will be destroyed
  # (because discord_text_channel.service_incidents is not in configuration)
- resource "discord_text_channel" "service_incidents" {
-       category                 = "829004029127557142" -> null
-       id                       = "923201733109366795" -> null
-       name                     = "⚠・service-incidents" -> null
-       nsfw                     = false -> null
-       position                 = 1 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "maybe there is a real problem out there" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.talos_flux_botkube will be destroyed
  # (because discord_text_channel.talos_flux_botkube is not in configuration)
- resource "discord_text_channel" "talos_flux_botkube" {
-       category                 = "1183167238266699776" -> null
-       id                       = "1183180834270883930" -> null
-       name                     = "🤖・botkube" -> null
-       nsfw                     = false -> null
-       position                 = 2 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "monitor + act on your K8s cluster" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.talos_flux_flux_system will be destroyed
  # (because discord_text_channel.talos_flux_flux_system is not in configuration)
- resource "discord_text_channel" "talos_flux_flux_system" {
-       category                 = "1183167238266699776" -> null
-       id                       = "1183177288876036167" -> null
-       name                     = "💬・flux-system" -> null
-       nsfw                     = false -> null
-       position                 = 1 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "flux-system alerts and info" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.talos_flux_prometheus_alertmanager will be destroyed
  # (because discord_text_channel.talos_flux_prometheus_alertmanager is not in configuration)
- resource "discord_text_channel" "talos_flux_prometheus_alertmanager" {
-       category                 = "1183167238266699776" -> null
-       id                       = "1183167373885329508" -> null
-       name                     = "🚨・alerts" -> null
-       nsfw                     = false -> null
-       position                 = 0 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "from Prometheus Alertmanager" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.techinik will be destroyed
  # (because discord_text_channel.techinik is not in configuration)
- resource "discord_text_channel" "techinik" {
-       category                 = "829004029127557142" -> null
-       id                       = "1048940283859062804" -> null
-       name                     = "👦・techinik・🎮" -> null
-       nsfw                     = false -> null
-       position                 = 2 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       type                     = "text" -> null
        # (1 unchanged attribute hidden)
    }

  # discord_text_channel.todos will be destroyed
  # (because discord_text_channel.todos is not in configuration)
- resource "discord_text_channel" "todos" {
-       category                 = "829004029127557142" -> null
-       id                       = "849036097455128576" -> null
-       name                     = "📋・todos" -> null
-       nsfw                     = false -> null
-       position                 = 7 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = false -> null
-       topic                    = "one day…" -> null
-       type                     = "text" -> null
    }

  # discord_text_channel.window_venting will be destroyed
  # (because discord_text_channel.window_venting is not in configuration)
- resource "discord_text_channel" "window_venting" {
-       category                 = "1183189895225815135" -> null
-       id                       = "1183189899344621619" -> null
-       name                     = "🪟・window-venting" -> null
-       nsfw                     = false -> null
-       position                 = 1 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       topic                    = "window venting" -> null
-       type                     = "text" -> null
    }

  # discord_voice_channel.afk will be destroyed
  # (because discord_voice_channel.afk is not in configuration)
- resource "discord_voice_channel" "afk" {
-       bitrate                  = 64000 -> null
-       category                 = "829004029127557143" -> null
-       id                       = "1028684203711271043" -> null
-       name                     = "💤・AFK" -> null
-       position                 = 1 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       type                     = "voice" -> null
-       user_limit               = 0 -> null
    }

  # discord_voice_channel.gaming will be destroyed
  # (because discord_voice_channel.gaming is not in configuration)
- resource "discord_voice_channel" "gaming" {
-       bitrate                  = 64000 -> null
-       category                 = "829004029127557143" -> null
-       channel_id               = "1267956772430413936" -> null
-       id                       = "1267956772430413936" -> null
-       name                     = "🎮・gaming" -> null
-       position                 = 2 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       type                     = "voice" -> null
-       user_limit               = 0 -> null
    }

  # discord_voice_channel.minecraft will be destroyed
  # (because discord_voice_channel.minecraft is not in configuration)
- resource "discord_voice_channel" "minecraft" {
-       bitrate                  = 64000 -> null
-       category                 = "829004029127557143" -> null
-       id                       = "1036298574000033823" -> null
-       name                     = "⛏・minecraft" -> null
-       position                 = 3 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       type                     = "voice" -> null
-       user_limit               = 0 -> null
    }

  # discord_voice_channel.stream will be destroyed
  # (because discord_voice_channel.stream is not in configuration)
- resource "discord_voice_channel" "stream" {
-       bitrate                  = 64000 -> null
-       category                 = "829004029127557143" -> null
-       id                       = "942076403099263100" -> null
-       name                     = "🎙・stream" -> null
-       position                 = 0 -> null
-       server_id                = "829004029127557141" -> null
-       sync_perms_with_category = true -> null
-       type                     = "voice" -> null
-       user_limit               = 0 -> null
    }

  # discord_webhook.talos_flux_botkube will be destroyed
  # (because discord_webhook.talos_flux_botkube is not in configuration)
- resource "discord_webhook" "talos_flux_botkube" {
-       avatar_hash     = "3a91d3cd26942ae1bffd2c32eecbda75" -> null
-       channel_id      = "1183180834270883930" -> null
-       github_url      = (sensitive value) -> null
-       id              = "1183180837626323126" -> null
-       name            = "talos-flux - Botkube" -> null
-       slack_url       = (sensitive value) -> null
-       token           = (sensitive value) -> null
-       url             = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # discord_webhook.talos_flux_flux_system will be destroyed
  # (because discord_webhook.talos_flux_flux_system is not in configuration)
- resource "discord_webhook" "talos_flux_flux_system" {
-       avatar_data_uri = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAMgAAADICAYAAACtWK6eAAAs1UlEQVR4nOyde1xb5f3Hn1zOycmNJLRI2AbCD3Q9qFBQagleGpzEYtGZeqHtRBdatdRrL8wt9TJp5rSlm2tp1baolQLTEqdUKt0k3RRQqVxaJW6DgaASbEsIJJyTkwu/V2h4DRmFXE44STjv/5qc8zzfknzynOd5vs/nyx4fHwc0NDQzw6Q6ABqaYIZNdQA0FxgYsouGzc4kAMAQGgf3UB0PzQVogVBMa5f1qn3HRne0dRMKAADH9ZpUwvpSmcXbVagQvk51fAsdBj0HoQaMcPJ214wUa5vGnrnYNWgsdFKdL3oQjYP/Nb/R0UxCC4QCGtqxZZpq0xvDFucSDy4fVeUInlMpBKVcmEl/WPMMLZB5xGh2iDRVpud0p/FHvb1XKmF9rs4X/VKWjJwJTHQ0M0ELZJ5oaMdu1lSb9g1bJibivjKmlPH+sHl1xFP0aDI/0AIJMD0Gm6SsdnSX7jSuIqtN1yRenS8qlCUjn5LVJs3M0AIJINpGS15Z7eiBYYszOgDNO5Qy3h+L8oRPSQQsLADt09ACCQw9BluUptr0Sls3cUeg+xLzmd3qfNGD2Uu5Hwa6r4UILRCSOVQ/WlBeb96N28YXzWO3jswlnNfUa0RPxESyzfPYb9hDC4Qkegy2/3vq8HCZvt92C1UxIBDjmy2rIx5VZvHfoSqGcIMWiJ9ghBNU6ixF5fVmDW4bF1Mdj4vMJZw33aPJeapjCXVogfhBa5c1SVNtOtw7aM+kOpbpIBDjnHs0qaI6llCGFogPuEaNfbWjam3j2K9x2zif6nhmIy0Rfk+dLypKkELfUh1LKEILxEuaOvFUTbXpNYPRkUZ1LJ6CQIwRlUJQvFbOf4UL0yccvIEWiIdghBPeXTPytLZpbBsAAKY6Hl+Ij2Z/uKNA/CAaB3dTHUuoQAvEA5o68es11aZXDEYHSnUsJECocgTFKoVgPxdmElQHE+zQApkFo9nBKa0Z2XX8FPZAqI4aFyM+mt28o0C8AY2Dv6Q6lmCGFshFqPts7JZS7ci+YYszgepYAgixdgVfo1IIXpAIWFaqgwlGaIFMY2DILtJUmUqbv7IWUh3LfBEfzT6zRRmhkiUjp6iOJdigBTIFbaPljtKakTLcNh5DdSxUIE9BXlSvET0nEbAsVMcSLNACuTBqXKKpMu1p/sp6N9WxUI2Yz+xR54sKspdyP6Y6lmBgwQvkiM58/77a0VLcNh5JdSzBhDwFeUW9RvRriYBlpDoWKlmwAukx2OLcyYWrqI4lWBHzmV9vUUYU5S7j1VEdC1UsOIFghJNVXm9+oPyEeRcAgEd1PKFAJsqp3qKMeDRBCp2lOpb5ZkEJRN9HXL798PDLvYN2OdWxhBpiPvPsWjn/4UKF8C2qY5lPFoRAMMLJLq83P1F+wvwcAAChOp5QBo2FjpcUiFUJUshAdSzzQdgLpLXLepWm2vRa76D9aqpjCRcQiGFSKQRbCxXCg1THEmjCViAY4eTurhn51WzOhcGCRMAEty3ngst+BIGzJgf4+xkraP9P8KdJobGQrqRA/GCCFPo31bEEirAUiNu58PVhizPokwv5CANsWy0CIv5/09Bdn0lFgxm0dtsojc1DRlQ5gpJwdX4MK4G4nQuf0Z3Gn6A6Fk/Jv4EHrl3yv9MiM+4EO6qGgTUkNDKRrvL5FmXE/bJk5AuqYyGTsBFIQzuWrak2vTxscV5GdSye8pPFLLD5jgjAYDBmfP/kaQy8+0lIWV6NKWW83ZtXRzwdLqNJyAtkYMguLq0ZKSXTuXA+cEliU54QJMZAF73G7hgHO4+awPcm57zG5i9SCesLt49wyCc/hrRAtI2WVW7nQinVsXhLeiIE7r1JOOd1nX0EOPBBSFpd2ZUy3h/dPsI41cH4SkgKxO1cuL+tm1hNdSy+wGYBoL5HDMQCz86Hv1w3Av75jT3gcQUCMZ/Zpc4XPRSqzo8hJ5BD9aPryuvNf8Rt44upjsVXbrkaAYqrPc9yGTTawc6aEeAIrSetqTjkKUj5ltURm0PN+TFkBNJjsCW4kwtXUh2LP0QKmWDb6giAeOkuom20gI++DO1DfwjE6N+yOuIRZRb/Xapj8ZSQEMih+tGi8npzSTikpBfcxAdpiRyv78MJJyipMoExa/B/XnORuYRz2O38OER1LHMR1AJp7bImup0LZVTHQgbx0Wzw2O0RPt/f2ImDox+PkRoTVSAQ46zb+bGa6lhmIygF4nYu/LW2cUwd7M6FnsIAAGxWRoCfLPa9sLDdMQ7+8M4I+G7IQWpsVJKWCL+rzhdtClbnx6ATSFMnfpWm2vS6wehIpzoWMrn2pzDIv1HgdzvdAzawt3aUlJiCBbfz47a1cv6rweb8GDQCwQgnNMW50PuH9CAGZgOwfY0YCLnkfPiH6kfBF1+HSA6KF8RHs/+6o0C8MZicH4NCIE2d+HWaatOrYeJc+D/cvpwHVqSQdwzFOOoAz79tArbQ3BqZC+sU50fKfwUoF0hpjemJypOW34ebc+EkiyOYYNudIgCzZ8638pXaTy2goSO0l31nIz6afWJvUaQyJpJNqQURpQ98RxrMysqTlt3hKg4Xq7N4pIsDTGw28kAEj/x2g4XeQXuOpsr0JtVxUCYQjHAyyk+YX6Cq//ngsh+xwZLYwGgfYjPArRnh7TnR/JX1jqZOPIvKGCgTiL7PluZnUf2ghs0CQJkV2C9wxuUwiItiBbQPqtF14PdQ2T9lAukdtAeidnjQsHwJB0glvu95eAKDwZh4hAtnegx233dWSYAygYj5TBNVfQcaHocBcjO489JX3CUQuDopbKdwIEHKpnQlgjKBoHFQl2sqQlX/gST3Gi6Yzw2vW5e5+gvPCbtYwPycyv4pE0hMJPt7eQpyhKr+A0WMhAmWo/O7zykRsMCKlLDaW50AgRjfrpXz36YyBkqXedVrRFukElYnlTGQzR1ZfMBizv+veXYqF0R6eAArRLCXFIjvo9o8m9K/qETAGjn4+CJZ5hLOYSrjIIsrL4UmvK2ogM1iTHhrhQNiPlO/Z2NkVjCcQqR8J30SbaPlttKakb24bTyW6lh8AWYDsHW1CESJqFt2dX2W+94fBV3fhWwOikMp4/2+KE/4O4mAFRR5/UEjEHDB14qnqTLt1p3G1wMAQmqBPzuFA/KWU5+Z/935C8dzQw2phHWqpEC8Pj2J00F1LFMJKoFM0tCO3eT2uAqZjcQdBWLAR4JjDvDq8RGg7w+ZUcSuyhH8RqUQ7AlG95Pg+ESn4Xr2PPbcJVcpZbxdrj8g1fF4QrCIA0w8w4fG4Bsfzf64YtviKzblRewMRnGAYBWIC9cfTL1GvG3PxshMqYR1hup45uKsKXhO+X1zPuh/UyyqHMGjFcWLb0Dj4H9RHcxsBOUj1nQwwsnYXTPyW23T2JZgrQp15aUQKLhJMJFESCWn/mUFR04Gb5HatET4gy3KiI1oHNxLdSyeEBICmaS1y3qFu9ZHBtWxzET8JSyQiSITju3TkUaywCKh/48+Vts46B20T5xPnwphHwfdA3bwyVfWYPXPGt6sjHhCmcV7I5R8e0NKIGAyTb7evLn8hPlpAACliWze8tOfsMH9PxMCxMe0kJOnMXDsMyxYBXBRMpdw/qxeI3osJpI9SHUs3hJyApmkx2C77KnDw6/o+20hVW8w43IYrF3hvXlD13c2UHYstMwaEIhh2LI64nFlFv/PVMfiK0E7SZ+LBCn074riqOyiVcL1CMQYpjoeTznTawNOH36UPu8KreO1mUs4bxzdHoWGsjhAKAtkkkKF8FBF8eIlaCwUErW8cWLcJ7OF0bHQGOnFfObX6nxR7t5Ni+6PiWSHzA/XxQh5gYALo8lgRXHUrUWrhHeL+cwFV8s7SHCuvIa79+j2qGRlFv841cGQRVgIZJJChfDtg48vuiIT5QS1nWW4IZWw/rmzUHLjjvskjwRLDhVZhJVAwIXR5OzeokVrSu4V3yrmM0NirT2EwZUy3s6j26OuzF7K/ZjqYAJB2AlkktxlvLqj26PS5SnIfqpjCUekEtbpPRsjr1evERdzYWbQb937StgKBFw4b2LctSGyaGeh5Doxn/kfquMJEyxKGe8p149PONQgnIuwFsgk2Uu5jUe3R10lT0HC2ocr0MRHs5srti3OUK8R7+DCzOBJPgsgC0Ig4MJoMrZrQ+STezZGXhMfzQ765MdgAoEYo2tX8B+r2X6JDI2D9VTHM58E1rgpCJElI5+jcVBGeb25uPKkZXs4256SARoLNZQUiO9PkEL9VMdCBQtmBJmKRMCyblktKqnYtjgtPprdRHU8wQgCMc4VrRLeX1EcddNCFQdYqAKZBI2DOyuKF69Q5QgeBwCEVi5HAEFjob9UFC9eWqgQvkF1LFSzoAUCLhzMsm3Ki3ipYtviK+Kj2X+jOh4qQSDGgPoe0eqK4qg7grUk2nyz4AUyCRoHd1cUL765aJXwIQRihJ7rgZ+kJcJvThxzvo6vpTqWYIIWyBS4MBMUKoSvVBQvTk5LhEOmlrc/iPnMb3cWSm4++PjiAomAdZ7qeIINWiAz4Hq8OPj44p+r80VrEIgRtsmP8hRk79HtUWj2Uu6CfrScDVogs6DM4le7vkCZSziUVzoiEzGfqd9ZKLlu14bIRyQCVmidwppnaIHMQUwk+/zeTYsK1PmiOxCIEerLnQ6ljPe7o9ujMrKXchupDiYUoAXiIcos/l+Obo9KlqcgB1xfNKrj8RYxn9l64LFF16jXiNUSASt4bU+CDFogXhATyTbv2hD5wM5CiULMZ3ZRHY+H2FU5giePPXdJVnoSp53qYEINWiA+MMX5sTSYR5P4aHZjxbbFV23Ki3ghWJ0Lgx1aID7idn7cumdj5HKphPUl1fFMw6LKETxWUbz4ejQO/orqYEIZWiB+IktGTh3dHuUaTXYAACg/bpqWCH9QsW3xlZvyIv4USgZtwQotEBJwfRHVa8RPuUaT+Gg2VTX1TJuVEao9RZG5oWLrGQrQAiERWTJypqJ4cYYqR7ANADBv6SqZSzhvH1VHLVknF7xGjxrkQguEZFxf0E15EbuOqqOuQWOhk4HsC4EYg+p80dq9mxbdnSCFDIHsa6FCCyRAuJ0f5UWrhA8gEIP0mvCZSziH3c6FVWS3TfNfaIEEmEKF8IDb+fEDMtoT85l9bufC+2Ii2ZRWgF0I0AKZB1yPPxXFUSuLVgnv8cf5ceU13DL3qBE2zoXBTsi6u4cqPQZb1MCQ40O7A1zlxW0YDIG7ly9BjgUwNJoZoAVCAQ4nYHYP2HYYhhyPu+b1s13L5TD+tiQWekjIZXbPX4Q0k9ACoZChUcfS7gH7Psw6njn9PSYDDMVL2b+KiWSXs5ggxErmhA+0QIKA8yOOa4dGnVk4MZ7EZILzi4TMM1Fi9jssJrBRHdtChxYIDc0s0KtYNDSzQAuEhmYWaIHQ0MwCLRAamlmgBUJDMwu0QGhoZoEWCA3NLNACoaGZBVogIcLAkF1EdQwLEVogIcK2g8ajZbUjxRjhRKiOZSFBCyR0YJefML+w6unvP27tsqZSHcxCgRZIiDFscV694aXzn2uqhjVGs4NPdTzhDi2QAIERzkD+bVnaprHf3LnjbEtDOyYLYD8LHlogAUDbaMn/2ZODhvV/PPdOj8F2CRltpiXCHyIQY2jqa8MWJ7rtkLFx64GhPxnNDgEZ/dD8EDrdnUR6DLYfaapN+9q6idsnX0MghkmZxXuuKE+4mwv793s0MGQXN3Tgd1fqLCqD0XHt1PfEfOY36nzRfdlLuQ1+dULzA2iBkMSh+tEN5fXmXbhtPGKm96USlr5QIdiuzCKnBmBrl/WK4y1YQUMHnj9sccZNvp6Jcg6XFIg30+XUyIEWCAk8XHZ+b/NX1k2eXBsfzW7cWxSpiIlkk1KjwzXXae603lh3Crtb14HnuwYTBGJ8t0UZ8QhdkNN/aIGQgNHs4GiqTHt0p/FCT+Z1FdsW/wiNgwcCEUtDOyZv6MBz27qJVRIB86uSAvGmBCn0XSD6WgjQAiERbaNlZVnt6P5hi/PS2a4LpECm0tplRdu6iWUylPM+GgefC3R/4QgtEJIxmh280pqRHcdPYQ8DAKCZrpkvgdD4D73MSzISAWtsx32SzXs2RqajsdDfqY6Hxj9ogcyB0eyYcRSYC1ky8kVFcdSKknvFeWRUoDKaHWx/26DxHlogs9DQjmXduePsVw+Xna8aGLL7tBGXu4x37Oj2qBR1vug+qYT1T19jeWTfkHb9H8/VHtGZ1w8M2SN9bYfGO+g5yAwYzQ6Jpsqk0Z3GN06+JuYzv96ijPhl7jKezp+2tY2WezJRzvGYSLZXBXZ+8eJZnb7ftmJKPJ/nZnD/molyatE46JREwCL8iYtmZmiBTKPus7GVpdqRfcMWZ/xM76+8hlu2KU/4ZEwk2zyfcU0XyFQQiHHWJRKXWNIS4b+lJ3H+PZ+xhTO0QKZQWmN6qPKkZf9c1yEQ49stqyOeWJnBfdvf9BFPmU0g00EgxvnMZM77aCz0sQzlNKJxcGfgIwxPaIFMASOcjN01I89pm8a2e3I9Ggt9uFkZ8UR6EudMoGPzRiDTEfOZPWgc9HkmyjmRngg3oHEw7RTvIbRAZqDus7EcTbWpAreNR3lyfSbKObxplXA7Ggf3ByomfwQyHQRiDKUlwR+kJcKuEeYfaBwcbHXegwZaIBehx2D78VOHhw/p+20KD2/B5CnIG4UKwfNoHNxHdjylNabtlSctxQAAIdlti/nMXjQO+jQT5dTLUM5xuiDof6EFMgeH6kcfKK83v4jbxj01TXBkopy31q7gl8qSEVJrpmOEEzR3Wm9s6ybkTXrrrb2D9vRALNWL+cyuTJRTl52KvIfGQZ/FRLJHye4jVFgwAnHNL3BiHJYIWFZv7+0x2KSaatMrbd3Ebd7cFx/Nblon55e5J/Ok1/pwjXJNeutyfZ9tpa4DvwW3jf+Y7D4AAKa0RLhJnor8RYZyjiZIoaEA9BG0LAiBtHZZkzXVptdxYly4a73kFjQO/tqXdhrasZs01aY9wxYn6uWto/JUpFIp4x1JS4I/DlSxf30f8ZPWbiKnWW/N0ffZrhm2OBPJ7iM+mv2RMot3UJnFezNQ/49gIqwF4l6VelbbNLYVAMAD7gmqOl+0JncZ74SPbXIqdRZVeb35Wdw27vVxWjGf2Xfw8UVXJ0ihgGfX6vuIJU166zJ9v03e3GlV4LbxGLLaTkuEj29RRmz09ccmVAhbgTR14tdoqk3lBqNjxmqya1fwny7KE77IhZleP3KBC0JByuvNj2obx7YMW5xeCYWqbN4egy2mrZtQNHTgN/UY7BkGo+OnfjZpUeUIfq1SCPaG62gSlgLpMdguvVNz9sxcKz7x0eyGHQXi9Wgc3ONrX0azI0LbOOYaUbZ6OgcIlnR3fR9xeZPemqnvt2U3d1pvxW3ji3xpx/XY5f47/ov8KKklLAUCLowg6dsOGt/z4Evr+hUsVikE+/35FcQIJ/N4C3bPEZ3lsd5B+7WzXRssAplOUyeerO+35eg68Nv0/bZlAABvfLfsqhzBb1QKwR4uzMQDGOa8ErYCAe5Hiof3DdVf7DFrKvHR7EZ1vmgjGbviLnFqm8Ye0nXgv5ipDrovAtn+hnE/AGAkPQk+JU9F3pcIWGP+xjkbA0N2cVsXkdVwGr9N14HfCQDwKINYKmGdKikQr09P4nQEMr75IqwFAtwn/J56Y3h/81fWAk+ul6cg+zflCX+bIIUGSegbrmvB8o+3YPe6d8EnznT4IpAZsnnbs1ORf6QlwvVoHNQe6HPnDe3Y9Q0d+M+b9VblxRI5p2BXyngvFOUJfxdoIQeasBfIJIfqRx/Zd2z0RQDAnObPCMQYys3gvqRSCHbFRLJJ+YB7DLbYuhZsdUMHrtxRIL7HX4FMwx4fzf4CjYV06Unwp/JU5JhEwCLFNWU6GOFktHUR12mbxtbpOvB1AICLnpMR85l6db5Ilb2U+0kgYpkPQlIgTZ341b7sUuv7iCse3jdUOWxxpnh4y7BSxvu9SiE4GBPJptRnyttcLDGfeTo7FdGlJcLvpyXBp2Ii2UayY8IIJ3S8BbvziM7yUO+g/bqL7erLU5CX1GtE2yUC1rweESCDkBKIa06hqTaVtXUTd7i+uOo14l972wZGOLm7a0ae1DaNPe3pPa4RRZ6KvFmoELyUIIV8XvHyBz+TFbH4aPbnuRncdxOi2R9mL+W2kRzexGZs5UnLo7oO/H4AAGf6+2I+s1+dL7o/1JwfQ0Ygh+pH15fXm0unOhemJcLle4oiN3Jhpten6Vq7rKmaatOrvYP2Zd7ch8ZC761dwT8gX4oc58JMh7f9+grJ2bzfy1ORWhnKqUlLghu9Pd04GwNDdkmlzrJV2zi2YaZs6EyU83pJgXhrqDg/Br1A9H1EwvbDwy/3DtpzZnofjYVO7lwvUfryCOF6nq7UWTaU15s1uG18sTf3ivnMvtwMboU8FTmcnsTx+ay5p2w9MLRbdxp/ZHKiTyKmtERYJ09FjuZmcI/6kqs2E0azQ1Jeb96kbRwrxm3jP9iPmjhwpox4WHkd/y9k9BVIgl4gpTWmJypPWnbPdo1UwupS54vukCUjX/jSh9HsEOyrHX22rgV7ELeNe23OIOYzW3MzuG+7vmTpSZwuX2LwBJegmzut1+n7bdc26625+n5bqqfLrx5CpCXC7yhlvDflS5G/+ZplMBXXiFJeb35W2zS2YfqSNxoLaUsKxA8nSKGg2xOaJOgF4kJTNbxV2zS2c7ZrEIhhUSkERYUK4WFf++kx2KSl2pHtzXqr68OEfWlDKmG1ZqciWnkqcizQewFGswPW99lSmvXWW9q6iav1/baVMz3/+4KYzxzIRDlH1sn5B8jYIW/tsl6+WzuyX99vy576OgIxzqkUgs2FCuGb/vYRCEJCIC7Kakc2lJ8w753ri5uJcqrV+aKHYiLZJl/70vcRMa5Hg7oW7JdenAP5HxCIcTYzmfNOdgryfloS/ElMJPt7X9vyBPd5EZm+3yZr1ltv1ffbrpltGdZT4qPZJ9fJ+ftXZnBr/J13HdGZ7y6vN+8dtjh/MD9BY6G/lRSI70+QQt/6Gy+ZhIxAXGg/tig1fzZVX8zScxLXr98WZcT9vmbsTjIwZF+sbRxTVeosD+O28Vh/2nI9vsRHs9tkKKdWpRD8YT420AaG7MIeg/1qXQd+W0MHnjNscV7hT3tiPrNbmcXbu1bOL5MIWD6fb+kx2C7RVJtebusm7pj6OgIxRlUKwW8KFcK9/sRJJiElEHBhD2T5toPGo54kBqYlwjXqfNEmMnbFtY2Wn9e1YOvbugmFvxNlCrN5pQ0deF6z3rq6rZuQ+Xp8F4EYQ8qsif2hAxIBa9jXeA7VjxaW15tfwm3jP8j5io9mN+4oEBeicXDAFz/mglKBuCadunb89txlPK9WM1wf9NaDxtreQfs1c12LQIwRZRZvZ1Ge8HkylmX1fcSldS3YuroWrGDY4vQpXTwYkhXduVbyhtP4XboOfLUvcy4EYgy6/7Z/4MJMpy9xNHXiV2qqTVqD0XHZtLaNe4oib5wPx5jZoFQgmqrh32ubxn6lyhE8sCkv4oA392KEE9pdM/K8tmlsiyfXIxCjT6UQPLtWzj9M1v5Fa5c1XdeB39nQgd9lMDqSPL0vGAQyFfeOuNIl+rZu4iZvJ/quR69NecLtyix+tS/9DwzZRdsOGqv1/bZbprX79dHtUclU5nOxnn32WUo6Npodwt8eMVXYnYDb1k3cymaBr71Z9YFYDOcNVyEnokTM9pZ/Etl25+yp2XYnELX8i7i9rgW7BwAwetmP2R0Qi+HX/yEmkj0gS0Y+XCcX7Mm4HK4Vcpnn+s86JLhtPHq2+5RZvNIokXdpF7948WyNtnHsAaPZGYkT41hsFNvvx8ZJXH9LNA7+8rblvMqcdOSQgMv8vsdgj/f0fAhuG4/86AvrnSdascyUeKglSuTdJqCQy7SuzOBW9xjskqlHBXDbuHhxBOufKQnwaV/+X2RA2QjS2mXN2PDS+c+mvORU5Qge3ZQXUeZtWwND9ks0VaZ9zV9ZV3t6DwIxvl4r5/9JmcV7g+w8K9cjYJPeeoeuA1/V1k0sn75XQUY2LwBgRJ6KvIfGQieyU5G/J0gh0q2GGtqxm8tPmDfp+215XrinOFQ5ArVKIXjJl3MhpTWmJytPWp6f/LdSxntVvUb8oLftkAVlI0iz3pr80Rc/SEFntHUTuWbMicuSkUZv2hJymZbcZby3okTMMy3/JK6zO8GMhTSnYncCsWvC7fpV1vfZLl0sYn4bE8kmxQ9KImCZUxLgU65f5Ltv4P0p43JOPRdmnMOIcTBsccb5MoJoG8fuPzfygzRzTu+gPaXlX8Qdb3009uiJVuz2b87ao3BifIysjbcEKfQf12PTDVdy3jJanLzeQXuq63Oa4zZmWzfxs4YOPCclHmqMErG8OnsvS0Y+tjvGLW3dxETmBAIxOm/L5L3j13/EDygbQfR9RNovdp5rnek9eQrySsl94kd9ybEymh28fbWjz2qbxh6e6bDSbEglrBbXiJKbwa0hSywzxMdBYIbd23mQl968A+7Ukeq0JPhTsuZcPQbbpYfqzerjp7D7PJzUY0WrhL8qVAj3eNuX+3jCn5Qy3j71GrFHBVIDAWUCcU0MVz39fc+wxTnjci0aC/1j53rJXb5urvUYbJdpqk2atm7iLh9ux9MS4Q/lqchbuRnctyUCFuZLDGTia7KimM/sy0Q5f87N4FbKkpF2MmLR9xGXa6pNz+v7bUpPrs9cwqksuU/8oLfp7qU1pqfRWOhU7jJenc/B+gmlq1iH6kcL9x0bPXix9xGI8U1Jgdiv4vhNnXjavmOjv3U/R/uCPS0RrnNnv54IxLO+J5CRzSuVsE7nZnAPKbN4VTGR7LP+xtTQjt1Qdmx0b++gfc4jzVIJS79rvWRlqNkEUTYHcZGexGk7Z3KI9P22zJned80l/tqG558zOZCMn8INvqw6xUaxDcosftVlP2LXfXPOsfjciNemb0yD0fHTZr31trc+GnvsRCu26puzdilOjDulkaw+f1fCPMVodi7697cTK0teZR1PxYyPR7d1Eyu1jWMPtXUTl0klrG9iItk+z1cSpNDXOenIQTaL4ZozXDfbBqoZH4+qa8F+kRDN/tR1n699zjdBsZOubbTkldWOHhi2OC+6PCqVsD5X54t+KUtG/No40vcRPz2iszx+/BQ2UXTfn7YAAJaJCk+x0MfZqYguXsruDHS9kIEh+yL3brhC32e7btji/Ik/7aGx0EfKLN6LKzO4db5u9gH3Y9f2w8PlvYP2rDkutavvEd2jvI6v9bWv+SQoBALcO7ulNSOlutO4apbLrEoZb/fm1RHP+Wst4/qi1bVg6yp1lg3DFueV/rQ1iZjP/A8aB32WiXI+TE+EP0Dj4G/IaPdiYIST1dZFLG3WW5UNHbjCYHRc7WtbUgnrTKFC8Iwyi+/zihFGOBFNlenXx09hc53WtG5WRjy0Ti543de+5ougEcgkDe3YzzTVpv3DFudFd6ZdE89NecInV2Zwq8lw9GvqxJdrG8cKXF+0uTb5vAGBGIOZyZwPXL/SMpTTHOgRpsdgi2nowFfXtWD57g03r3PG3EJRr8zg1voaa91nY67PsGqux0GljPeAeo3YqwyK+SboBAIuLIWKNFWmZ3Wn8cdnu04qYX2izhcVy5KRj0jql9vcab2p4TR+j9sLak4HFG8Q85m9CVJ2izwV+RCNhU6kJ3ECdr69x2CLq2vB7mrowNf1DtrTvL0fjYVOblZGbHbNE33s/8cP7xv6wGB0zDY6O0vuFf88dxmv1pc+5oOgFMgkDe3YMk216Y1hi3PJbNehsdA/VDmCZ7KXck+S1bfr8UXXga+qa8Fub+sicgJUWuC8PBU5hsZCOhnK+ThQpdFau6xXaRvHVLoOfJ2nVbMmkacg+9VrRE/5cobcaHYIHtk39Jb7INd0RlQ5ghKVQlAazL6+QS0QcOGLyttdM1KsbRp7Zq5rpRLWp4UKwc6VGVwtmX90jHAy27qIZc16a15dC3bzsMWZQVbbU5FKWJ1piXCdLJnzd3kq8gEXZtrJbN/1ha1rwe6u1Fk2GYyOdE/vQyDGQFGe8LF1csHb3vbp+qF5ZN/Qy23dxPrJ11yjU0mB+MEEKRT0Xr5BL5BJXL+CmmrTa72D9jknogjE+M59sOdwTCSb9BNqRrMjQteB5zV04Dfp+2w3BKIOh3v/5VhaInwiN4NbR/bSaEM7tqL8hPk3+n7bzZ7ek4lyarYoI1xfbK9HE03V8M66FmyDSiEoLlQIX/U6YIoIGYGAC79G7PJ685byE+ZnPZwfWNMS4eO5Gdw3V2Zw3wlg4ZolDR349T2D9ut0HfitAACfXNJnwen2tXo7OxV5O0EK9ZLVcEM7trz8hHmHvt92kyfXi/nMQXW+6O7spdx/eNvXwJD9kkAfOyabkBLIJO4191d6B+0e7ywjEGNEnopU52Zwq9KS4MZAlESbpLXLmqDvt+U0661yfZ8tY9ji/D8y23eJJfvC/6U6QQqRspTc1IlnaapNuwxGx3JPrl+7gv9sUZ7wuWCeP5BBSAoEuJ9ty+vND5SfMJd6m5Qo5jO/TUuCj2enIu/LU5HaQBvAuSs9Ldf3225o7rTmkriUTLgm+Mos3qsrM7jv+vv/cM21tI1jv9hXO/oCbhuXznU9Ggu9v6cocq1EwCLNeC7YCFmBTNJjsMU9dXi4TN9vW+VjE8SEf20i/GF2KnICjYP/TXKI/4O7luDKZr31Z/o+27XDFuel/raJQIzzuRncsrVy/sEEKeRXvfaBIbuwrHb0heOnsI1zXSuVsPR7iyJzyBrJgo2QF8gkh+pH73dbk/plpOb6wNE46EMZyvnI7ZIe0OOeGOFk6PtsVzbrrYpmvfV6fb8t109TCEKegrytzOKVypIRvzx46z4bk5dqR8rnKneAQIzvdq6X3EZ22etgIGwEAtyTwEqd5Ym6Fuzei6XRe4tUwjrlEksmynkfjYM6YiLZAS2+aTQ7oGa9Na+p03pzs956iwe1OC4KGgvVq3IEmuylXJ83UgeG7HxNlelA81fWNbNdJ+Yzvzz23CVXhducJKwEMonR7ICbO60rtU1j97q9l8jK7yDio9nt6YlwQ1oS3JKJcuokAlbAyo25a3FcXdeC3dWst97p62QfjYWOFa0SPuXPeRDXCL3v2OiBmUY3eQryonqN6LlA1SShkrAUyFQGhuwRdS3YPXUt2Bp3pqlPlqIXQyphtblHmDo0DmqPiSTPTGE6De1YWkMHfnez3rp22OKM8/b+TJRzZIsyQu3rnkpTJ77M7Uk2YaIXH80+s2mVsDB7KbfFl/ZCgbAXyFR6DLYf1bVguW3dxK1t3UQeAIBFcheO+Gh2W3oi/Le0JPgTeSpSF4jlZIxwQrp2fIW2aezBtm7idi/nLCaljPfi5tURO32JbWDILl3/x/Pvy1DOe0V5wt+T5QYfrCwogUxl4kvWgefVtWAKfZ/tpgDthk+UmpahnI8zUc57aUlwO9lLygND9kWVOktRXQu2Ydji9NgeVSphfanOF20kK9EzXFmwAplOa5f1ima9VdHWTVzf1k2Q5pI+FTGf+Q0aB/09OxU5Jk9F/kLm/MVodnDqWrD8Sp1l6xwZtFMhlDJe2ebVEdvmsxhQKEEL5CI0tGM36Ptty90u6UsBmNtKyEvsaYnwB/JU5F2XYMh0UdE2Wu48VG9+xlOhSCWsMyUF4rXpSRyf6quEM7RAPMBodvD0fbalzXrryrZuIt2d4Derw7yXEGmJ8El5KlKlzOJV+mJ3NB2McDKOt2D3ltaM/Ba3jXuyVDyyWRnxyDq5wOf6KuEILRAfcNfhuLFncKK0QF6PwZ7i7wbl1OblqcgRpYz3miwZafK7McLJ2lc7+rS2cWyzJ9Wz5CnInpL7xFsCmasWStACIQHX83+PwZ6m68BdI8wyfb/tZ2TUEnTb9LyyVs4/5O9qkb6PiNVUmw7Nld6OQIzzO9dLbvfW3TJcoQUSADDCydR14Iq2LiKrtZu4tXfQnuLnZqVZKeO5hLI7QQp9509sh+pH7yuvN++eacTLXMJ5U71GtDnQ2QKhBC2QeaDHYItr6MDl+n7bLboO/Od+nHXH5ClIRaFC8DwaB/t8nr3HYPu/rQeNr/cO2q8Hk1VnV0c84o+jSbhCC2SecZ91X1nXgt3W1kWswm3jMT4048hEOa9tUUY87atRtWsepakyvTBsdkrco4ZXtqALBVogFDKRmNhpvbHhNL5W14Hne3uuBYEY5twM7v6iPOEzweAfHI7QAvEAo9mBaBvH1qUlwu1oHNTmjwPhxcAIJ3y8BbvrUL15o8HomMud8AcgEGNgy+qIXymz+EFZSjmUoQXiIT0Gm6SsdnR3s96qSEuCP8lEOe/LUM77CVKI9DIJrV3WqypPWjbpOvBfepNcGR/Nrt9RIN7oz/yE5ofQAvGShnYsR1NtKpt0fhTzmfrsVKROnopo05LgFjL3DwaG7KJKnWVTXQv26Gy+xdOwqnIET6gUglcCMdItNGiB+IDb+fE53Wn80amvi/nM79A46K+5Gdy/yFORd8k6PGQ0OwTaxrH15fXm33hq/JaWCL9fUiBWhZqLSLBBC8QP3M6Phy9SDtoiT0Xezr2GW5GZzPkHGSMLRjiR3TUjW+pasM0e7NyPuqs77fe334UMLRA/cTs//krbNHZRR3Mxn/lNJsqpWCfnv4bGwX67CfYYbNKy2lHNxZzw0Vjo7+p80YPBUIg/1KEFQhJNnXhqqXakvHfQPqulZ3w0++Q6Of9leSryjkTA8ispsaEdu7bs2OiByQpPCMQwqRQC16jxij/t0vwXWiAkghFOqLzevLX8hPmZuc6TiPnMvtwM7isqheBP3tbum4rR7ODsqx19Ut9vyygpEG8gq8ItzQVogQQAL50fLUoZb69KIdhNT6iDD1ogAcLtI7zBU+dHBGKMukYU9654QL24aDyHFkiA6THYLnU7P97qyfUIxDirUgieXivnv8aFmWFtiBAK0AKZJw7Vj6rK6827cNu4xJPrxXzmaXW+aGP2Uq7fh6ZofIcWyDwyMGSP1lSZypq/sq729J5MlPNaSYF4my8Vnmj8hxYIBWgbLcrSmpEyTxzUwYVil9vUa8S7Ah8ZzXRogVDEwJBdVF5vLq5rwTZe7LErPpr9hdu58LP5j5AG0AKhHtdjV1nt6Lbjp7DHJ50eEYhhUmbxXlQpBLsD6f1LMze0QIKEgSF7VLPemiKVsL6XJSNnqI6H5gK0QGhoZoGssgA0NGHJ/wcAAP//wOB+qjAohkMAAAAASUVORK5CYII=" -> null
-       avatar_hash     = "fd31eadeadc98e57bc4eabc2564875b1" -> null
-       channel_id      = "1183177288876036167" -> null
-       github_url      = (sensitive value) -> null
-       id              = "1183177291560394874" -> null
-       name            = "talos-flux - Flux Reconciler" -> null
-       slack_url       = (sensitive value) -> null
-       token           = (sensitive value) -> null
-       url             = (sensitive value) -> null
    }

  # discord_webhook.talos_flux_prometheus_alertmanager will be destroyed
  # (because discord_webhook.talos_flux_prometheus_alertmanager is not in configuration)
- resource "discord_webhook" "talos_flux_prometheus_alertmanager" {
-       avatar_data_uri = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAHIAAAByCAYAAACP3YV9AAANdElEQVR4nOydB7QdRf3Hv9xAQoB//poQRAZQaQnOgSDlQCABjIggR2QEC1IECUqAICZKkSIgKOUYaugKBJQmjAUJJeEoAUMPAqMxNClDaAlF8yiB4JnH7142+7bvlH0v73PO5r67d+/ML/e3MzvlV5ZHH0EL3gLw/wBWATAYwP/R0f4/vgGgC8BbAF4zr0yqtwOLbY3lQgtQFi34CgBGARhJxwYARtDriiWKWgLgGQDzAMylw/w9h0n1msP/ghMar0gt+CAAYwHsQMeoSCtzxVMAZtBxB5NqgeP6atNIRVKr+xKAvej14wHFWQxgNoBrAFzXVKU2RpFacNPKdgbwdQC70vOuaSwhpU4zimVSvRlaoDbBFUkK3BPA0QA2DC1PCczg6TwAZzGpXg0tTDBFasFXAjARwA8BfCKUHBZ4F8C1AE5iUj0RSgjviqRpwoEAjgWwpuPq7jXPNQCneRggmanMJQBOYFItdFxXD1o+K9OCb0rPmAs9KPEkANvQc83HfHlF6mHmasH304J7bSReKtOCDwHwMwCHABjgocrTmVRHUt2zAIzxUGecOwEczKRSPipz3iK14F8G8E8Ah3lS4gMAjom8X89DnUlsC2COFvxEGtA5xVmL1IIPBPALGsz46mY+ALAlk+r+iBwLA89DDXeZOTGT6llXFThpkVrwdQHcDWCS5wHVTVElEvM91p/GGGqdu7mqwLoiteC7A3gIwOa2yy7ARQnn5gSQI4mhAKQW/BwtuPVHjFVFasEPoeH+EJvlFsR0obclnL89gCxZmJHtDVrwwTYLtaZI81CnlQ6vU5oIdzGpFiecn07rpU3iqwBu1YJ/zFaBtX90001owS8AcLwdkSpzb9JJJtXLAP5Uobzf1hcpk7FmiqIFX8NGYbUUSZPeywEcZEOYmmSNCH9dsqxTaMrkmo0AzNKCf7JuQXVb5BkA9q4rhCWyFq5vMfddwXLMRP44AJ+3JFce6wC4mRZNKlNZkVrwyQAm16ncMq+nfcCkeh/AFQXKMNdNYFKZ+ein7IqXySY0oh1YtYBKitSC70Wt0TVnA3ik4LWpiiQuowWDLK5gUv2D/l69YL22GGfqp02F0pT+khZ8DD1zfEz0nwcw2kz0C1ybqUjaYpqVU8bZkb/fLSaiVb4F4OQqXyylSC34cDJ5qNwFlGQTJlUXmXzMy7k2r0UiZ9BzL5Mq2voXFZTRNkfR+nQpCiuSmvw0c3OXFq063XWRScXBGde9VNC08XcA/pvy2SWx908WF9MqpqebpgVfq8yXyrTIowDsVF6uWnS6bybVTAAzU657rEhhTCrTyv6Q8JEZ5MgqZTpimOn5yAitEIUUSc/FE2uJVo14dzk15boye35XJ5x7MGFX/28lynTB1mWel7mKpLviIk+77HGejr2/mdZU45RpPbcBiJs0Jq3HzigwynXNJC34JkUuLNIiJwH4bH2ZKnFP9A2T6h0Af0647tGiBdJ6bLx77dFl09Le3WWEdYBpPOcXmZJkXqAFX5tWOUKRNF34S+z9Ito2K0NUcUtM15pyXZFFBNeY6df+eRflafosACvbk6kUTzCpXkg4/9fY+zuZVGXnfPdF/n4yw9DYPE9fKVm2C07Vgg/LuiBVkVrwcQCEE7GKcUvSSSaVmRZEf/ibK5T9FHllIWvjmUa5Z1Yo3zarAvhp1gVZLfIY+/KU4rqMz9qLA+/T3LAUTKq2J5bh7zmXTy242OCa8VrwVEPuREVqwbeitb9Q6JyBxr/odSaT6sWKdTxPr5kTf+p2p1SswyaDyZAtkbQWebQ7eQpxPbWaNNpbUmfXqKNdxlMFrjWKrHrD2GSCFjzRIrCHIrXgGwH4ihex0rkq5/PXaMoxvUYdhVokPnpWhlgQiTMEwKFJHyS1SJ92qEk8xqRKmw60MYo8lPYNqzIfQFcJP41LI116SCYm7VsupUgtuJlq7OFVrJ5MK3DNdUyqO2vW82LKKlEiTKr3qm4xWWY4gB67I/EWKSiAQiiWFDF6suTjX0qRxLWRLjkk+8RPxBW5rz9ZEpnNpCpqW1OX+WUVSct7v3InUmF20YIPjZ7oKJKW474QRKyPuN5jXc9WHIleRj1HSAYB+Hb0RLRF7hHQuBi005C0V+gEeuY9UOF7z5SwI3LJN6Jvoorb0b8sS/Eok+rfnuucXfF7TXBDGK0F74xnuhVJw9kQzqBR6o5Cq5A3zUkjhKxxlicfzG7aLXKrgLscbfIs3KxD+5tVKLtt5ood2n+0Fbl9OFk6VO3mvEPba00Ic9bRW1uRvszj03iBSfVcYBnK0gR5N9aCr4qIIjcNKw+CxaepQdKmt29a5G6AFnkChXBMjeLMt94hTdijBEXF7NboiNCSUDiw3sZboQUgRoIUuUFoSRr0o5ShKUF7Oy1yZGhJaMmpt9EUmTstct3QkjQ0pGceIXeJoqylBR/YakAwIZDXbm/DpyNsFkaHw1sNubNG+g7CZ4Em9GRthrUoKn9oVm3IoKsQWvD1yGOqKQxtSotEYPPLsmwXWoAYK7YasBjQ5puhBShBaLumOINaHt3I8xijBf90aCHy0IKv1sDeY0ArwxXbNwMopmvTOahBN3+bd5ukSMP3bESBcoUWfJU0A+HAvGMU+R8HBT9NAeinkg9H0TpWzvM6CszhZFdalEXkwm5+h/Fk5OyCruW04PcB2MJB4SOZVN2W2eRxy8kvfjRZJKQt1i8BMJZJFdqHfykomPAjAFZKuWQBuehFj3lRHxaHv/WGRpEzHT28T2VSpToD0YboVqTYLQFsBqAd9tLcAFswqVz0FqWhmOQzIzYyr5Kz7P1tpeWFudaCb1bFaq8gw42ALzkqfLwW/GRygOkBZa+5KRrViu76zUmp36H4r03ga2SodYFRIJOqiAdXnAkO5ALtHC00LfIEh8+lyUyqJvgWBoWswp/L6Jbr8AiTalTLsYfRZC14mZyOfZUfO1Ii2t7brhW5BkXMWmYhd/GJDqvo1l9bkS4DAx2tBQ8Vp6cJnOnYZniu+adFgxGXHlADAZzbC7epaqMF355Cd7qk07XCg3Gwmd4c4LiORkF+GRc79v7uAvAwIoqc4bCyNufRXGpZ4TIA6zuuoxMsqq3IeFgwFwwC8JuoB1FfRQs+HsDuHqrq6K1bkUyqeZEAQi4ZAeCqvvy81ILvCOB8T9V1etKof6QvV7FdAXzfU11e0YKPpFDhhQPm1uD19vMRsRisNyUFGXDEOVrwLQC856k+X/hMtT+d0mB0E1Xk72kF34dRkbljv+uhnr7M5dE3na6VRj8+gzH0U53n4zONePCHK/3K009Fro7H6ltKkbSZ24QwXf1k0yOyc1LA+Ss9heraO1C2G5cc5cFp+MGkTOpJijwXwI8iu/WuuJFJ1Rvd6VLRgu/rQZGnJJ3sESCJAs2m5dfoJyyP0eyiB2mRrs5smJlkPx9yWlpo00RFMqkWNCR4Xj8f8XhKFqFusmLPTaFtkn6awenRlZw4qYok874mhH/u58NcJ5k9ZF40yCkNiYS4LLO4SNjvTEVSKMxDGpDsa1nmPCZVbhK33PisTKq7+pfugqGL2hwX2uCllLxzPGdzXdYxveCuTKoi+aWLRUxmUr1CZvN9bUmtyfy8qBJRJvQ1k+o+AD+pLFY/ZZgB4PgyXygbw3xK2hJRP9aYD2DvnJRSPShtBEXucLMBrFf2uxWZEXjDe10AR3iqy0w1dmFSlY6ZXsmaTQu+DgAzmvXhJn4pk+pAD/UkogXfuWKOyrKYFrgPkyo3gU0SldJDkH/gdgBervL9koQOQ+qr/glVlYg6eT6YVI9TvBnXe4qbasEHO64ji2081GFGqBfXKaBWwhYm1SyyqHapzJWTknr5QAs+BMBOjqs5B8CxdQupnXmHSTUdwBcdR90/PJB1+gEOY/WZCf9xTKof1Eyf2I2VFEpMqrspWkVuUs2KjHHog5+IFnx9h7ZLi2lgY618q3c5hSC71VGkxzcBjPKRdonCydzuKNrJ2wD2ZFJZnY9bTWpGP/JoAH+0WS5hnle3uo6MRUq81JESnwawrW0lwkV2Okp1uxuAydSF2MS09DtcKVMLPgDAhQD2d1D8jWYEzqS630HZbnMpa8E/R1lQbTt8vgHgiLpD9igk6+UANrZVJtFFc8QiKYcr43wkSOnWp1AAJNv1mbv8BCbVo1ULoBg4EwEcSbn+bfIQgAOZVM6Tonkb0mvBx1LkKG656A8ojf1UcsXONeOkLnRjSkU83sEUw/QYxwE4P8tgyiZe52Za8BUoPf7xjkKWvEet4B5aPnyJftTBFDd9NQAb0XTGVeToawBMYlLNd1R+IkFcwLXga5KfhJlw95XIWDMAnESrXd4J6suvBR9Gz6fDGpJ/pCzvU7r9M+o8p23QiKAMtMdpFLofgLVDy1OARQAkgF8yqR4OLQyaosgoWnBOsQzMKHf10PJEMNOIG2iT+7YaaX2d0DhFttGCDwKwC+18jAPwmQBivEFW3rcbBTKpXMW2rU1jFRmH1nHH0bE15aayvTK1gALs3kHHQ76mD3XpNYqMQ3FgR9CynXndkExPhtLAKSnClukOF9KxgNzs51GExbnkhdYr+V8AAAD//0EanPG21k2KAAAAAElFTkSuQmCC" -> null
-       avatar_hash     = "0d65bab35f816e5b5c7d56f2f225ca34" -> null
-       channel_id      = "1183167373885329508" -> null
-       github_url      = (sensitive value) -> null
-       id              = "1183171344599371877" -> null
-       name            = "talos-flux - Prometheus Alertmanager" -> null
-       slack_url       = (sensitive value) -> null
-       token           = (sensitive value) -> null
-       url             = (sensitive value) -> null
    }

  # vault_kv_secret_v2.terraform_discord will be destroyed
  # (because vault_kv_secret_v2.terraform_discord is not in configuration)
- resource "vault_kv_secret_v2" "terraform_discord" {
-       cas                 = 1 -> null
-       data                = (sensitive value) -> null
-       data_json           = (sensitive value) -> null
-       delete_all_versions = true -> null
-       disable_read        = false -> null
-       id                  = "infra/data/techtales/terraform-discord" -> null
-       metadata            = {
-           "created_time"    = "2024-02-15T23:46:02.038300159Z"
-           "custom_metadata" = "null"
-           "deletion_time"   = null
-           "destroyed"       = "false"
-           "version"         = "3"
        } -> null
-       mount               = "infra" -> null
-       name                = "techtales/terraform-discord" -> null
-       path                = "infra/data/techtales/terraform-discord" -> null

-       custom_metadata {
-           cas_required         = false -> null
-           data                 = {} -> null
-           delete_version_after = 0 -> null
-           max_versions         = 0 -> null
        }
    }

  # module.techtales.data.discord_server.techtales will be read during apply
  # (config refers to values not yet known)
 <= data "discord_server" "techtales" {
+       afk_channel_id                = (known after apply)
+       afk_timeout                   = (known after apply)
+       default_message_notifications = (known after apply)
+       explicit_content_filter       = (known after apply)
+       icon_hash                     = (known after apply)
+       id                            = (known after apply)
+       owner_id                      = (known after apply)
+       region                        = (known after apply)
+       server_id                     = (known after apply)
+       splash_hash                   = (known after apply)
+       verification_level            = (known after apply)
    }

  # module.techtales.discord_category_channel.family will be created
+ resource "discord_category_channel" "family" {
+       channel_id = (known after apply)
+       id         = (known after apply)
+       name       = "🌈・FAMILY"
+       position   = 1
+       server_id  = (known after apply)
+       type       = "category"
    }

  # module.techtales.discord_category_channel.general will be created
+ resource "discord_category_channel" "general" {
+       channel_id = (known after apply)
+       id         = (known after apply)
+       name       = "🦄・GENERAL"
+       position   = 0
+       server_id  = (known after apply)
+       type       = "category"
    }

  # module.techtales.discord_category_channel.home_automation will be created
+ resource "discord_category_channel" "home_automation" {
+       channel_id = (known after apply)
+       id         = (known after apply)
+       name       = "🏠・HOME AUTOMATION"
+       position   = 4
+       server_id  = (known after apply)
+       type       = "category"
    }

  # module.techtales.discord_category_channel.home_ops_talos_flux will be created
+ resource "discord_category_channel" "home_ops_talos_flux" {
+       channel_id = (known after apply)
+       id         = (known after apply)
+       name       = "🚢 HOME-OPS - TALOS-FLUX"
+       position   = 3
+       server_id  = (known after apply)
+       type       = "category"
    }

  # module.techtales.discord_category_channel.voice will be created
+ resource "discord_category_channel" "voice" {
+       channel_id = (known after apply)
+       id         = (known after apply)
+       name       = "🔊・VOICE CHANNELS"
+       position   = 2
+       server_id  = (known after apply)
+       type       = "category"
    }

  # module.techtales.discord_server.techtales will be created
+ resource "discord_server" "techtales" {
+       afk_channel_id                = "1028684203711271043"
+       afk_timeout                   = 900
+       default_message_notifications = 1
+       explicit_content_filter       = 0
+       icon_hash                     = (known after apply)
+       id                            = (known after apply)
+       name                          = "techtales.io"
+       owner_id                      = (known after apply)
+       region                        = "rotterdam"
+       server_id                     = (known after apply)
+       splash_hash                   = (known after apply)
+       verification_level            = 3
    }

  # module.techtales.discord_text_channel.chat will be created
+ resource "discord_text_channel" "chat" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "💬・chat"
+       nsfw                     = false
+       position                 = 0
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.configs will be created
+ resource "discord_text_channel" "configs" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "📁・configs"
+       nsfw                     = false
+       position                 = 6
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "configs for later"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.crowlex will be created
+ resource "discord_text_channel" "crowlex" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "👦・crowlex・🎮"
+       nsfw                     = false
+       position                 = 3
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.floor_heating will be created
+ resource "discord_text_channel" "floor_heating" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🌡・floor-heating"
+       nsfw                     = false
+       position                 = 0
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "floor heating"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.food will be created
+ resource "discord_text_channel" "food" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🍲・food"
+       nsfw                     = false
+       position                 = 8
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "mjam mjam mjam.at"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.gametime will be created
+ resource "discord_text_channel" "gametime" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🎮・gametime"
+       nsfw                     = false
+       position                 = 1
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "gametime"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.holidays will be created
+ resource "discord_text_channel" "holidays" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🏖・holidays"
+       nsfw                     = false
+       position                 = 9
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "holiday planning"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.home_automation will be created
+ resource "discord_text_channel" "home_automation" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🧙・home-automation"
+       nsfw                     = false
+       position                 = 3
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "beep beep beep"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.info will be created
+ resource "discord_text_channel" "info" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "ℹ・info"
+       nsfw                     = false
+       position                 = 0
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "share all kind of informations with the family"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.links will be created
+ resource "discord_text_channel" "links" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🔗・links"
+       nsfw                     = false
+       position                 = 5
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "links for later"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.nas will be created
+ resource "discord_text_channel" "nas" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "📢・nas"
+       nsfw                     = false
+       position                 = 2
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "synology disk station alerts and infos"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.reviews will be created
+ resource "discord_text_channel" "reviews" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "reviews"
+       nsfw                     = false
+       position                 = 10
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "reviews"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.service_incidents will be created
+ resource "discord_text_channel" "service_incidents" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "⚠・service-incidents"
+       nsfw                     = false
+       position                 = 1
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "maybe there is a real problem out there"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.talos_flux_botkube will be created
+ resource "discord_text_channel" "talos_flux_botkube" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🤖・botkube"
+       nsfw                     = false
+       position                 = 2
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "monitor + act on your K8s cluster"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.talos_flux_flux_system will be created
+ resource "discord_text_channel" "talos_flux_flux_system" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "💬・flux-system"
+       nsfw                     = false
+       position                 = 1
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "flux-system alerts and info"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.talos_flux_prometheus_alertmanager will be created
+ resource "discord_text_channel" "talos_flux_prometheus_alertmanager" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🚨・alerts"
+       nsfw                     = false
+       position                 = 0
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "from Prometheus Alertmanager"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.techinik will be created
+ resource "discord_text_channel" "techinik" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "👦・techinik・🎮"
+       nsfw                     = false
+       position                 = 2
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.todos will be created
+ resource "discord_text_channel" "todos" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "📋・todos"
+       nsfw                     = false
+       position                 = 7
+       server_id                = (known after apply)
+       sync_perms_with_category = false
+       topic                    = "one day…"
+       type                     = "text"
    }

  # module.techtales.discord_text_channel.window_venting will be created
+ resource "discord_text_channel" "window_venting" {
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🪟・window-venting"
+       nsfw                     = false
+       position                 = 1
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       topic                    = "window venting"
+       type                     = "text"
    }

  # module.techtales.discord_voice_channel.afk will be created
+ resource "discord_voice_channel" "afk" {
+       bitrate                  = 64000
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "💤・AFK"
+       position                 = 1
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       type                     = "voice"
    }

  # module.techtales.discord_voice_channel.gaming will be created
+ resource "discord_voice_channel" "gaming" {
+       bitrate                  = 64000
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🎮・gaming"
+       position                 = 2
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       type                     = "voice"
    }

  # module.techtales.discord_voice_channel.minecraft will be created
+ resource "discord_voice_channel" "minecraft" {
+       bitrate                  = 64000
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "⛏・minecraft"
+       position                 = 3
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       type                     = "voice"
    }

  # module.techtales.discord_voice_channel.stream will be created
+ resource "discord_voice_channel" "stream" {
+       bitrate                  = 64000
+       category                 = (known after apply)
+       channel_id               = (known after apply)
+       id                       = (known after apply)
+       name                     = "🎙・stream"
+       position                 = 0
+       server_id                = (known after apply)
+       sync_perms_with_category = true
+       type                     = "voice"
    }

  # module.techtales.discord_webhook.talos_flux_botkube will be created
+ resource "discord_webhook" "talos_flux_botkube" {
+       avatar_hash = (known after apply)
+       channel_id  = (known after apply)
+       github_url  = (sensitive value)
+       id          = (known after apply)
+       name        = "talos-flux - Botkube"
+       slack_url   = (sensitive value)
+       token       = (sensitive value)
+       url         = (sensitive value)
    }

  # module.techtales.discord_webhook.talos_flux_flux_system will be created
+ resource "discord_webhook" "talos_flux_flux_system" {
+       avatar_data_uri = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAMgAAADICAYAAACtWK6eAAAs1UlEQVR4nOyde1xb5f3Hn1zOycmNJLRI2AbCD3Q9qFBQagleGpzEYtGZeqHtRBdatdRrL8wt9TJp5rSlm2tp1baolQLTEqdUKt0k3RRQqVxaJW6DgaASbEsIJJyTkwu/V2h4DRmFXE44STjv/5qc8zzfknzynOd5vs/nyx4fHwc0NDQzw6Q6ABqaYIZNdQA0FxgYsouGzc4kAMAQGgf3UB0PzQVogVBMa5f1qn3HRne0dRMKAADH9ZpUwvpSmcXbVagQvk51fAsdBj0HoQaMcPJ214wUa5vGnrnYNWgsdFKdL3oQjYP/Nb/R0UxCC4QCGtqxZZpq0xvDFucSDy4fVeUInlMpBKVcmEl/WPMMLZB5xGh2iDRVpud0p/FHvb1XKmF9rs4X/VKWjJwJTHQ0M0ELZJ5oaMdu1lSb9g1bJibivjKmlPH+sHl1xFP0aDI/0AIJMD0Gm6SsdnSX7jSuIqtN1yRenS8qlCUjn5LVJs3M0AIJINpGS15Z7eiBYYszOgDNO5Qy3h+L8oRPSQQsLADt09ACCQw9BluUptr0Sls3cUeg+xLzmd3qfNGD2Uu5Hwa6r4UILRCSOVQ/WlBeb96N28YXzWO3jswlnNfUa0RPxESyzfPYb9hDC4Qkegy2/3vq8HCZvt92C1UxIBDjmy2rIx5VZvHfoSqGcIMWiJ9ghBNU6ixF5fVmDW4bF1Mdj4vMJZw33aPJeapjCXVogfhBa5c1SVNtOtw7aM+kOpbpIBDjnHs0qaI6llCGFogPuEaNfbWjam3j2K9x2zif6nhmIy0Rfk+dLypKkELfUh1LKEILxEuaOvFUTbXpNYPRkUZ1LJ6CQIwRlUJQvFbOf4UL0yccvIEWiIdghBPeXTPytLZpbBsAAKY6Hl+Ij2Z/uKNA/CAaB3dTHUuoQAvEA5o68es11aZXDEYHSnUsJECocgTFKoVgPxdmElQHE+zQApkFo9nBKa0Z2XX8FPZAqI4aFyM+mt28o0C8AY2Dv6Q6lmCGFshFqPts7JZS7ci+YYszgepYAgixdgVfo1IIXpAIWFaqgwlGaIFMY2DILtJUmUqbv7IWUh3LfBEfzT6zRRmhkiUjp6iOJdigBTIFbaPljtKakTLcNh5DdSxUIE9BXlSvET0nEbAsVMcSLNACuTBqXKKpMu1p/sp6N9WxUI2Yz+xR54sKspdyP6Y6lmBgwQvkiM58/77a0VLcNh5JdSzBhDwFeUW9RvRriYBlpDoWKlmwAukx2OLcyYWrqI4lWBHzmV9vUUYU5S7j1VEdC1UsOIFghJNVXm9+oPyEeRcAgEd1PKFAJsqp3qKMeDRBCp2lOpb5ZkEJRN9HXL798PDLvYN2OdWxhBpiPvPsWjn/4UKF8C2qY5lPFoRAMMLJLq83P1F+wvwcAAChOp5QBo2FjpcUiFUJUshAdSzzQdgLpLXLepWm2vRa76D9aqpjCRcQiGFSKQRbCxXCg1THEmjCViAY4eTurhn51WzOhcGCRMAEty3ngst+BIGzJgf4+xkraP9P8KdJobGQrqRA/GCCFPo31bEEirAUiNu58PVhizPokwv5CANsWy0CIv5/09Bdn0lFgxm0dtsojc1DRlQ5gpJwdX4MK4G4nQuf0Z3Gn6A6Fk/Jv4EHrl3yv9MiM+4EO6qGgTUkNDKRrvL5FmXE/bJk5AuqYyGTsBFIQzuWrak2vTxscV5GdSye8pPFLLD5jgjAYDBmfP/kaQy8+0lIWV6NKWW83ZtXRzwdLqNJyAtkYMguLq0ZKSXTuXA+cEliU54QJMZAF73G7hgHO4+awPcm57zG5i9SCesLt49wyCc/hrRAtI2WVW7nQinVsXhLeiIE7r1JOOd1nX0EOPBBSFpd2ZUy3h/dPsI41cH4SkgKxO1cuL+tm1hNdSy+wGYBoL5HDMQCz86Hv1w3Av75jT3gcQUCMZ/Zpc4XPRSqzo8hJ5BD9aPryuvNf8Rt44upjsVXbrkaAYqrPc9yGTTawc6aEeAIrSetqTjkKUj5ltURm0PN+TFkBNJjsCW4kwtXUh2LP0QKmWDb6giAeOkuom20gI++DO1DfwjE6N+yOuIRZRb/Xapj8ZSQEMih+tGi8npzSTikpBfcxAdpiRyv78MJJyipMoExa/B/XnORuYRz2O38OER1LHMR1AJp7bImup0LZVTHQgbx0Wzw2O0RPt/f2ImDox+PkRoTVSAQ46zb+bGa6lhmIygF4nYu/LW2cUwd7M6FnsIAAGxWRoCfLPa9sLDdMQ7+8M4I+G7IQWpsVJKWCL+rzhdtClbnx6ATSFMnfpWm2vS6wehIpzoWMrn2pzDIv1HgdzvdAzawt3aUlJiCBbfz47a1cv6rweb8GDQCwQgnNMW50PuH9CAGZgOwfY0YCLnkfPiH6kfBF1+HSA6KF8RHs/+6o0C8MZicH4NCIE2d+HWaatOrYeJc+D/cvpwHVqSQdwzFOOoAz79tArbQ3BqZC+sU50fKfwUoF0hpjemJypOW34ebc+EkiyOYYNudIgCzZ8638pXaTy2goSO0l31nIz6afWJvUaQyJpJNqQURpQ98RxrMysqTlt3hKg4Xq7N4pIsDTGw28kAEj/x2g4XeQXuOpsr0JtVxUCYQjHAyyk+YX6Cq//ngsh+xwZLYwGgfYjPArRnh7TnR/JX1jqZOPIvKGCgTiL7PluZnUf2ghs0CQJkV2C9wxuUwiItiBbQPqtF14PdQ2T9lAukdtAeidnjQsHwJB0glvu95eAKDwZh4hAtnegx233dWSYAygYj5TBNVfQcaHocBcjO489JX3CUQuDopbKdwIEHKpnQlgjKBoHFQl2sqQlX/gST3Gi6Yzw2vW5e5+gvPCbtYwPycyv4pE0hMJPt7eQpyhKr+A0WMhAmWo/O7zykRsMCKlLDaW50AgRjfrpXz36YyBkqXedVrRFukElYnlTGQzR1ZfMBizv+veXYqF0R6eAArRLCXFIjvo9o8m9K/qETAGjn4+CJZ5hLOYSrjIIsrL4UmvK2ogM1iTHhrhQNiPlO/Z2NkVjCcQqR8J30SbaPlttKakb24bTyW6lh8AWYDsHW1CESJqFt2dX2W+94fBV3fhWwOikMp4/2+KE/4O4mAFRR5/UEjEHDB14qnqTLt1p3G1wMAQmqBPzuFA/KWU5+Z/935C8dzQw2phHWqpEC8Pj2J00F1LFMJKoFM0tCO3eT2uAqZjcQdBWLAR4JjDvDq8RGg7w+ZUcSuyhH8RqUQ7AlG95Pg+ESn4Xr2PPbcJVcpZbxdrj8g1fF4QrCIA0w8w4fG4Bsfzf64YtviKzblRewMRnGAYBWIC9cfTL1GvG3PxshMqYR1hup45uKsKXhO+X1zPuh/UyyqHMGjFcWLb0Dj4H9RHcxsBOUj1nQwwsnYXTPyW23T2JZgrQp15aUQKLhJMJFESCWn/mUFR04Gb5HatET4gy3KiI1oHNxLdSyeEBICmaS1y3qFu9ZHBtWxzET8JSyQiSITju3TkUaywCKh/48+Vts46B20T5xPnwphHwfdA3bwyVfWYPXPGt6sjHhCmcV7I5R8e0NKIGAyTb7evLn8hPlpAACliWze8tOfsMH9PxMCxMe0kJOnMXDsMyxYBXBRMpdw/qxeI3osJpI9SHUs3hJyApmkx2C77KnDw6/o+20hVW8w43IYrF3hvXlD13c2UHYstMwaEIhh2LI64nFlFv/PVMfiK0E7SZ+LBCn074riqOyiVcL1CMQYpjoeTznTawNOH36UPu8KreO1mUs4bxzdHoWGsjhAKAtkkkKF8FBF8eIlaCwUErW8cWLcJ7OF0bHQGOnFfObX6nxR7t5Ni+6PiWSHzA/XxQh5gYALo8lgRXHUrUWrhHeL+cwFV8s7SHCuvIa79+j2qGRlFv841cGQRVgIZJJChfDtg48vuiIT5QS1nWW4IZWw/rmzUHLjjvskjwRLDhVZhJVAwIXR5OzeokVrSu4V3yrmM0NirT2EwZUy3s6j26OuzF7K/ZjqYAJB2AlkktxlvLqj26PS5SnIfqpjCUekEtbpPRsjr1evERdzYWbQb937StgKBFw4b2LctSGyaGeh5Doxn/kfquMJEyxKGe8p149PONQgnIuwFsgk2Uu5jUe3R10lT0HC2ocr0MRHs5srti3OUK8R7+DCzOBJPgsgC0Ig4MJoMrZrQ+STezZGXhMfzQ765MdgAoEYo2tX8B+r2X6JDI2D9VTHM58E1rgpCJElI5+jcVBGeb25uPKkZXs4256SARoLNZQUiO9PkEL9VMdCBQtmBJmKRMCyblktKqnYtjgtPprdRHU8wQgCMc4VrRLeX1EcddNCFQdYqAKZBI2DOyuKF69Q5QgeBwCEVi5HAEFjob9UFC9eWqgQvkF1LFSzoAUCLhzMsm3Ki3ipYtviK+Kj2X+jOh4qQSDGgPoe0eqK4qg7grUk2nyz4AUyCRoHd1cUL765aJXwIQRihJ7rgZ+kJcJvThxzvo6vpTqWYIIWyBS4MBMUKoSvVBQvTk5LhEOmlrc/iPnMb3cWSm4++PjiAomAdZ7qeIINWiAz4Hq8OPj44p+r80VrEIgRtsmP8hRk79HtUWj2Uu6CfrScDVogs6DM4le7vkCZSziUVzoiEzGfqd9ZKLlu14bIRyQCVmidwppnaIHMQUwk+/zeTYsK1PmiOxCIEerLnQ6ljPe7o9ujMrKXchupDiYUoAXiIcos/l+Obo9KlqcgB1xfNKrj8RYxn9l6
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.